{"Deep-Thoughts/Everything-is-connected":{"slug":"Deep-Thoughts/Everything-is-connected","filePath":"Deep Thoughts/Everything is connected.md","title":"Title","links":["Deep-Thoughts/Thoughts-on-consciousness"],"tags":["philosophy","consciousness"],"content":"Sometimes i get this weird feeling that everything is connected, when i start to reason about something it starts to appear very similar to some other idea that i had been thinking about.\nI starts to think about god/creator and the infinite loop of the question who is the creator of the creator goes on. Similarly if we take a scientific route and think about the fundamental particles in physics like an electron or a quark jf you are nerdy enough the same infinite loop of where/what it came from goes on.. so very similar infinite loops.\nI wrote  Thoughts on consciousness there i discuss this idea of when i think about consciousness as the observer it goes into this infinite loop of observers.. since as soon as you pinpoint an observer the entity thats pinpointing is the new observer. So similar patterns of inifinite recursion arises in many cases of thoughts.\nThen i wondered is it possible are these all the same things then? Call me superstitous i dont care but, it does seem everything is connected or maybe everything is the same thing. I personally beleive what some call god, others call it laws of universe/fundamental particles, or whatever everything js composed of it.. and maybe even consciousness is some fundamental particles that just is there.. and came frlm nothing. At some point something must have came from nothing."},"Deep-Thoughts/Observing-consciousness":{"slug":"Deep-Thoughts/Observing-consciousness","filePath":"Deep Thoughts/Observing consciousness.md","title":"Observing consciousness","links":[],"tags":["philosophy","consciousness"],"content":"I tried observing consciousness. Maybe that’s the way to understand it better than reading neuroscience books. One should be able to start from the very basics. And it turns out observing consciousness is very straightforward. It’s just sitting in your room, simply observing what’s happening, the thoughts in your mind. As thoughts pass through your mind, try to ask the question: “Who is experiencing this thought?” We can very easily find an answer. We always seem to point to an entity that’s experiencing it within our mind, but we just can’t hold on to the feeling of that entity.\nI tried hard. The more I tried, the more I kept looking for what was experiencing the thought. And I always found that as soon as I pinpoint what’s observing or experiencing, there is something else that is experiencing the observing of the observer. And as soon as I catch that, there’s another observer I can find. It’s almost like there are infinite observers or experiencers.\nLogically thinking this might not exactly be the path to finding consciousness, this is almost like asking the question of who created the creator, for which the answer is always just infinite number of the same question. So maybe the way of thinking about it is not the right way. Its almost scary similar how many questions in the universe appears very similar, this question about consciousness goes into an infinite loop, the question about the universe goes into an infinite loop, everything goes into an infinite loop of questions. Maybe its all just the same question then.\nAnother realisation that started to hit me was that, as much as I tried to grasp the observer, it slipped away from me, just like time. Time never stays in one place. And it felt almost like what I was trying to observe was just the present moment. What I was trying to grasp was the present moment. To live in an eternal present. What I’m getting in this observation is probably glimpses of the present moment.\nMaybe the strategy needs to change, or maybe my perspective does. Trying to catch the observer in the act is not possible because the one who catches is the real observer, and it has no end. Maybe the observer is not a thing. Maybe it’s a flow, a presence. Maybe it’s just present. And it cannot be observed, maybe it can only be felt. I don’t know. I may have biases from what I’ve heard about “the now,” but it really seems like “the now” is consciousness, or at least that consciousness resides in the now.\nEven when we dwell on memories from the past or wonder about the future, everything is still happening in the present moment. Everything is happening to the present moment. Everything is experienced by the present moment.\nMaybe the present moment is consciousness. Does that mean consciousness is the same for everyone? Does that mean everyone shares a single consciousness? I don’t know yet. I will search for an answer when I try it again.\nThis whole exercise is probably what others call meditation. Now I truly see the point of it, a way to learn about oneself, and maybe even answer the biggest questions of the universe."},"Deep-Thoughts/Thoughts-on-consciousness":{"slug":"Deep-Thoughts/Thoughts-on-consciousness","filePath":"Deep Thoughts/Thoughts on consciousness.md","title":"Thoughts on consciousness","links":[],"tags":["philosophy","consciousness"],"content":"This is a topic that I’m very fascinated by. I don’t know much about it, but to me, the most fascinating question that led me into the rabbit hole of consciousness is: “What are thoughts made of?”\nI recently watched this comedy Netflix show called Philomena Cunk, where the character Philomena interviews really smart people and asks oddly specific, dumb questions. In one episode, she asks a scientist if everything is made up of atoms. The scientist answers yes, everything is made of atoms. She then starts picking examples, and he keeps confirming each one is made of atoms. Finally, she asks, “Are thoughts made up of atoms?” and he goes silent for a moment before answering no, contradicting his earlier statement.\nThis reminded me of the question I’ve always had and have deeply explored: “What are thoughts made of?” Trying to answer this leads to a deeper rabbit hole about consciousness. A simple Google search might satisfy most people, but not me. Google says that thoughts are just intricate networks of neurons firing and communicating, but that does not really answer the question. It only creates more confusing ones, like “Why does a bunch of neurons firing cause the experience of having thoughts?” “What exactly is an experience?” “Who is experiencing this experience?” “Is the who me?” “Who am I?” “Is there really an I?” And the questions keep going.\nHard materialists believe everything is made of matter. I am certainly not a hard materialist. I don’t think thoughts or experiences are made of matter. I think they are some fundamental aspect of the universe. I just don’t see how experience can be material. We cannot track it down to a purely physical process, and even if we do, the deeper question still arises: why does this physical process give rise to experience?\nThis line of thinking was formalized by David Chalmers, an Australian philosopher, as the hard problem of consciousness. He defines simple problems as those that can be explained by function and consequence, by structure and dynamics. Examples of simple problems include how we recognize a face, how we know when we are hungry, how birds fly, how computers work.\nAll of these have explanations that reduce to structure and dynamics. We know we are hungry because low glucose is detected by the brain, the hypothalamus triggers hormones, and that causes physical sensations. We know how birds fly because they follow physical laws. But consciousness is different. We cannot explain why it feels. Why there is a conscious experience of feeling hunger. This is the hard problem. We cannot explain what it feels like to be something without bringing in something beyond structure and dynamics.\nThe question I am most interested in is: “Who is having the conscious experience?” That leads to many more questions about the self. Thinking deeply about this makes one feel detached from the sense of self, but that enters the territory of speculation. I am not a scientist. I am not trying to impress anyone.\nThis whole study of consciousness and the ideas floating around in scientific circles feel to me like science is catching up to spirituality."},"Random/How-I-Over-Engineered-This-Blog-Instead-of-Paying-$10":{"slug":"Random/How-I-Over-Engineered-This-Blog-Instead-of-Paying-$10","filePath":"Random/How I Over-Engineered This Blog Instead of Paying $10.md","title":"How I Over-Engineered This Blog Instead of Paying $10","links":[],"tags":["life","tech"],"content":"How I Over-Engineered This Blog Instead of Paying $10\nAm I too late to the blogging scene? Probably, yes. Who reads blogs these days, huh? I do, and probably a very small set of people like me do. And mostly, this is for me, not really for others. And i wouldn’t really call this a blog, its more like taking notes in public. Thought it’d be kind of fun to learn in public. And this is the first such session, me trying to setup the perfect free blogging setup instead of paying 10$ for a service which would have done the job much better than me.\n\nA Quest for not paying\nToday, I took the time to set up my blogging workflow. I already use Obsidian a lot for note-taking and journaling, so I searched for ways to publish Obsidian notes as blogs. There’s a nice paid tool called Obsidian Publish, Me being me, of course, I’d spend hours of engineering effort to create something instead of paying 10 bucks for it. And I did exactly that.\nI found this nice tool called Quartz, a static site generator built with Obsidian in mind. Jumped into the docs and set it up.\n\nThe Struggles\nNow, I faced a few problems.\n\n\nSyncing Notes Like a Mad Scientist\nI use obsidian-git to sync my notes across multiple devices. Also, because I don’t want to pay for Obsidian Sync (which, to be fair, would have been a much better UX).\n\n\nKeeping Secrets, Sharing Thoughts\nTo publish my blogs, I needed Quartz to track only the notes I wanted to go public. This wasn’t very straightforward. What I ended up doing was creating a git subtree called Public and using Quartz there.\n\n\nGitHub Pages Said “Nope”\nGitHub won’t let you use GitHub Pages for free with private repos. So I had to write a GitHub Actions workflow to copy over the build folder generated by Quartz to a new public repo and push it there each time I make a change in my Obsidian repo (which contains all my private notes, hence why I can’t just make it public).\n\n\nAfter hours… I managed to get it working. (If you’re reading this, then yeah, it’s working.)\n\nI Did It!\nIt was fun… kinda. It’s been a while since I’ve been able to spend time on stuff like this, and I’m glad I did. I’m going to start writing more here—more public notes. I don’t care if anyone reads them or not. Just knowing that someone might and that they might find it useful is enough. But also, it feels strangely satisfying to just put my thoughts out there on the open web, accessible to anyone.\nNow, I kinda want to revamp my personal website and add more stuff there, but I only have so much time. I’ll leave it for another day."},"index":{"slug":"index","filePath":"index.md","title":"Hello 👋","links":[],"tags":[],"content":"Welcome to my public notes section! This is where I brain dump ideas, thoughts, and random stuff that crosses my mind. The ideas here are just thought dumps - unfiltered, unpolished, and very much works in progress.\nConsider this my digital scrapbook of sorts. Some notes might be half-baked, others might be complete nonsense, but they’re all part of my thinking process.\nIf you’re looking for more about me, visit my website at krishna.dev.\nHappy exploring!"}}